Tekla Open API Reference for Tekla Structures 2025
Projection.LineSegmentToPlane Method
 Returns a new line segment which is a projection of the given line segment onto the given plane.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static LineSegment LineSegmentToPlane(
	LineSegment LineSegment,
	GeometricPlane Plane
)
Public Shared Function LineSegmentToPlane (
	LineSegment As LineSegment,
	Plane As GeometricPlane
) As LineSegment
Parameters
LineSegment
Type: Tekla.Structures.Geometry3d.LineSegment
The line segment to be used.
Plane
Type: Tekla.Structures.Geometry3d.GeometricPlane
The plane to be used.
Return Value
Type: LineSegment
The new projection line segment.
See Also
Reference
Projection Class
Tekla.Structures.Geometry3d Namespace